load-test-basic.yml
config:
  target: 'http://localhost:3001'
  phases:
    # Fase 1: Warm up - 10 usuarios por 1 minuto
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    # Fase 2: Carga normal - 25 usuarios por 3 minutos  
    - duration: 180
      arrivalRate: 25
      name: "Normal load"
    # Fase 3: Carga alta - 50 usuarios por 2 minutos
    - duration: 120
      arrivalRate: 50
      name: "High load"

scenarios:
  - name: "Navegación básica de usuarios"
    weight: 60
    flow:
      # Página principal
      - get:
          url: "/"
          headers:
            User-Agent: "LoadTest-Browser-{{ $uuid }}"
      - think: 2

      # Página de login
      - get:
          url: "/login"
      - think: 1

      # Página de exploración
      - get:
          url: "/explore"
      - think: 3

  - name: "Test de APIs críticas"
    weight: 40
    flow:
      # API de posts (rutinas)
      - get:
          url: "/api/supabase/posts"
          headers:
            Accept: "application/json"
      - think: 1

      # API de meditaciones
      - get:
          url: "/api/supabase/meditations"
          headers:
            Accept: "application/json"
      - think: 1

      # API de videos
      - get:
          url: "/api/supabase/videos"
          headers:
            Accept: "application/json"
      - think: 2

      # API de previews
      - get:
          url: "/api/supabase/previews"
          headers:
            Accept: "application/json"
      - think: 1